eventer/app/controllers/events_controller.rb

  def show
  	current_date = Date.today.to_s
  	event_id = params[:id]
  	city = params[:city]
  	region = params[:region]
  	@single
  	@all_events = HTTParty.get("http://api.bandsintown.com/events/search?date=#{current_date}&location=use_geoip&radius=&format=json&app_id=YOUR_APP_ID")
  	@all_events.each do |event|
  		if event['id'] == event_id.to_i
  			@single = event
  		end
  	end
    date = @single['datetime'].gsub!("T", " ")
    @the_date = DateTime.parse(date).strftime('%A %B %d, %I:%M %p %Y')
    event_search = Event.where({venue_name: @single['venue']['name']})
---
SELECT "events".* FROM "events" WHERE "events"."venue_name" = $1  [["venue_name", "NYC NYC Dunkin Donuts iHeart Radio Lounge"]]

  def create
  	event = Event.create(event_params)
  	EventsUser.create({event_id: event.id, user_id: session[:user_id]})
---
INSERT INTO "events" ("artist_name", "venue_name", "location", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "events_users" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 2], ["user_id", 15], ["created_at", "2015-08-31 20:22:05.303024"], ["updated_at", "2015-08-31 20:22:05.303024"]]

  def destroy
  	event =Event.find(params[:id])
  	event_user = EventsUser.find_by({event_id: params[:id]})
  	if event_user['user_id'] == session[:user_id]
  		event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "events_users".* FROM "events_users" WHERE "events_users"."event_id" = $1 LIMIT 1  [["event_id", 2]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 2]]