eventer/app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password_digest", "about_me", "twitter", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
	def create
		@user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 16]]
UPDATE "users" SET "user_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_name", "Bleradfdfadf"], ["updated_at", "2015-09-01 15:14:36.321130"], ["id", 15]]
---
	def update
		@user = User.find(params[:id])
		@user.update_attribute(:user_name, params["user"]["user_name"])